laravel/app/Http/Controllers/Api/UserController.php

    public function store(Request $request)
    {
        // Validar los datos de la solicitud
        $validatedData = $request->validate([
            'name' => 'required|string',
            'email' => 'required|email|unique:users,email',
            'password' => 'required|string',
            'rol_id' => 'nullable|boolean', // Permitir que rol_id sea opcional y booleano
        ]);

        // Convertir rol_id a 1 si es true
        $rol_id = $request->input('rol_id', false);
        if ($rol_id === true) {
            $rol_id = 1;
        }

        // Si rol_id no se proporciona en la solicitud, establecerlo en false por defecto
        $userData = array_merge($validatedData, ['rol_id' => $rol_id]);

        // Crear el usuario
        $user = User::create($userData);
---
insert into "users" ("name", "email", "password", "rol_id", "ticket_id", "updated_at", "created_at") values ('James', 'james@gmail.com', '$2y$12$ieOgJxduQYT9yzTsh3rS1u7FqNdG8UCjJBfei3dxZ6R6IHKfCo36m', '1', '', '2024-04-27 11:24:39', '2024-04-27 11:24:39')